cask_args appdir: "/Applications", require_sha: true
tap "homebrew/bundle"
tap "homebrew/services"
# tap "hashicorp/tap"
# tap "spacelift-io/spacelift"

# brew "aws-iam-authenticator"
brew "awscli"
brew "bash"
brew "coreutils"
brew "curl"
# brew "docker-credential-helper-ecr"
brew "ffmpeg"
brew "findutils"
brew "gawk"
brew "gh"
brew "git-lfs"
brew "git"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "grep"
# brew "hashicorp/tap/vault"
# brew "helm"
brew "httpie"
# brew "iam-policy-json-to-terraform"
brew "jq"
brew "jupyterlab"
brew "libfido2"
brew "macos-trash" if OS.mac?
brew "mas" if OS.mac?
brew "media-info"
brew "mise"
brew "mkvtoolnix"
brew "mp4v2"
brew "mypy"
# brew "mysql-client"
brew "node"
# brew "opa"
brew "openssh"
brew "opentofu"
# brew "pinentry-mac"
brew "pinentry"
brew "pipx"
brew "pnpm"
brew "postgresql@17"
brew "prettier"
brew "python"
brew "r"
brew "rclone"
brew "ruff"
brew "rust"
brew "shellcheck"
brew "shfmt"
# brew "spacelift-io/spacelift/spacectl"
brew "starship"
brew "taplo"
brew "terraform-docs"
# brew "terraformer"
brew "terragrunt"
brew "tmux"
# brew "trivy"
brew "typescript"
brew "uv"
brew "vim"
brew "wget"
brew "wrangler"
brew "ykman"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "brave-browser"
# cask "chatgpt"
# cask "datagrip"
# cask "docker"
cask "font-recursive-code"
# cask "inkscape"
cask "karabiner-elements"
cask "kitty"
# cask "microsoft-office-businesspro"
# cask "notion"
cask "orbstack"
# cask "postico"
# cask "postman"
cask "protonvpn"
# cask "rstudio"
# cask "session-manager-plugin"
# cask "slack"
cask "syncthing"
# cask "tableplus"
# cask "visual-studio-code"
cask "vlc"
cask "vscodium"
# cask "zoom"
cask "zotero"

# mas "1password", id: 1333542190
mas "1password for safari", id: 1569813296
mas "bear", id: 1091189122
mas "daisydisk", id: 411643860
mas "duckduckgo privacy essentials", id: 1482920575
mas "keynote", id: 409183694
mas "numbers", id: 409203825
mas "pages", id: 409201541
