cask_args appdir: "/Applications"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/git"
tap "stripe/stripe-cli"
tap "versent/homebrew-taps"


brew "antigen"
brew "aws-iam-authenticator"
brew "aws-sam-cli"
brew "awscli"
brew "bash"
brew "cfssl"
brew "cocoapods"
brew "direnv"
brew "deno" if OS.mac?
brew "ffmpeg"
brew "fluxctl"
brew "fx"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "grep"
brew "httpie"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "libfido2"
brew "macos-trash" if OS.mac?
brew "mas" if OS.mac?
brew "openssh"
brew "pinentry"
brew "pnpm"
brew "prettier"
brew "pyenv"
brew "redis"
brew "ruby"
brew "saml2aws"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stern"
brew "stripe"
brew "tilt"
brew "watchman"
brew "yarn"
brew "ykman"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "android-sdk"
cask "aws-vault"
cask "brave-browser"
cask "contexts"
cask "docker"
cask "duckduckgo"
cask "flipper"
cask "git-credential-manager-core"
cask "kitty"
cask "notion"
cask "pgadmin4"
cask "postico"
cask "postman"
cask "raycast"
cask "sizeup"
cask "skitch"
cask "studio-3t"
cask "switchresx"
cask "tailscale"
cask "transmit"
cask "vscodium"
cask "zoom"

mas "magnet", id: 441258766
