eamodio.gitlens
esbenp.prettier-vscode
foxundermoon.shell-format
ms-python.python
octref.vetur
sdras.vue-vscode-snippets
streetsidesoftware.code-spell-checker
timonwong.shellcheck
wallabyjs.quokka-vscode
yzhang.markdown-all-in-one
