AmazonWebServices.aws-toolkit-vscode
be5invis.toml
denoland.vscode-deno
eamodio.gitlens
esbenp.prettier-vscode
foxundermoon.shell-format
ms-azuretools.vscode-docker
ms-python.python
octref.vetur
sdras.vue-vscode-snippets
streetsidesoftware.code-spell-checker
timonwong.shellcheck
yzhang.markdown-all-in-one
