eamodio.gitlens
yzhang.markdown-all-in-one
esbenp.prettier-vscode
ms-python.python
foxundermoon.shell-format
timonwong.shellcheck
octref.vetur
Equinusocio.vsc-material-theme
dbaeumer.vscode-eslint
ms-vscode.vscode-typescript-tslint-plugin
sdras.vue-vscode-snippets
WallabyJs.quokka-vscode
